import socket
from time import sleep
# Создаём объект socket, а именно обычный TCP сокет
sock = socket.socket()
# Устанавливаем блокировку - это значит, что сокет будет ждать выполнения каждой операции беспрерывно
sock.setblocking(1)
# Подключаем сокет к IP адресу и порту
sock.connect(('192.168.1.69', 9090))

# Прописываем бесконечный цикл отправки введенного с клавиатуры сообщения и получения ответа
while True:
    # Принимаем сообщение от пользователя стандартным вводом
    msg = input()
    # Отправляем сообщение, перед этим закодировав в байты
    sock.send(msg.encode())
    # Если сообщение пользователя было exit значит прерываем цикл
    if msg == 'exit':
        break
    # Если клиент ввёл любой другой текст вместо exit тогда ожидаем сообщение от сервера
    data = sock.recv(1024)
    # Выводим полученное сообщение от сервера, предварительно раскодировав его из строки байт
    print(f'accepted from server:$ {data.decode()}')

# Закрываем сокет
sock.close()
